data/pressure_sweep/icoFoam_base/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


SS    -.000025;
kick  -.001;


internalField   uniform 0; 

boundaryField
{
    inlet
    {
        type            uniformJump;
        patchType       cyclic;
        jumpTable       table ((0 $SS) (25 $SS) (25.5 $kick) (26 $SS));
        value           nonuniform List<scalar> 
20
(
3.7035e-07
3.79346e-07
3.92307e-07
4.10267e-07
4.41257e-07
5.03544e-07
6.22079e-07
8.35225e-07
1.17614e-06
1.65513e-06
2.16997e-06
2.48928e-06
2.62917e-06
2.6867e-06
2.70886e-06
2.7174e-06
2.72125e-06
2.72358e-06
2.72536e-06
2.72662e-06
)
;

    }
    outlet
    {
        type            uniformJump;
        patchType       cyclic;
        value           nonuniform List<scalar> 
20
(
-1.96296e-05
-1.96207e-05
-1.96077e-05
-1.95897e-05
-1.95587e-05
-1.94965e-05
-1.93779e-05
-1.91648e-05
-1.88239e-05
-1.83449e-05
-1.783e-05
-1.75107e-05
-1.73708e-05
-1.73133e-05
-1.72911e-05
-1.72826e-05
-1.72787e-05
-1.72764e-05
-1.72746e-05
-1.72734e-05
)
;

    }
    Walls
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
